------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_user_policy.es3permissonsforgh will be created
  + resource "aws_iam_user_policy" "es3permissonsforgh" {
      + id     = (known after apply)
      + name   = "ecs-s3-bucket"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::qppsf-conversion-tool-artifacts",
                          + "arn:aws:s3:::qppsf-conversion-tool-artifacts/*",
                        ]
                      + Sid      = "s3ecsiam"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "github-actions-ecr"
    }

  # aws_iam_user_policy.ssmpermissionsforgh will be created
  + resource "aws_iam_user_policy" "ssmpermissionsforgh" {
      + id     = (known after apply)
      + name   = "ecs-ssm"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:PutParameter",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameter",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "s3ecsiam"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "github-actions-ecr"
    }

  # module.conversion-tool.aws_ecs_cluster.conversion-tool-ecs-cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "conversion-tool-ecs-cluster" {
        arn                = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-dev"
        capacity_providers = []
        id                 = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-dev"
        name               = "qppsf-conversion-tool-dev"
        tags               = {
            "Name"            = "qppsf-ct-ecr-dev"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.conversion-tool.aws_ecs_service.conversion-tool-service must be replaced
-/+ resource "aws_ecs_service" "conversion-tool-service" {
        cluster                            = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-dev"
        deployment_maximum_percent         = 100
        deployment_minimum_healthy_percent = 0
        desired_count                      = 1
        enable_ecs_managed_tags            = false
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-east-1:003384571330:service/qppsf-conversion-tool-dev/conversion-tool-service-dev" -> (known after apply)
        launch_type                        = "FARGATE"
        name                               = "conversion-tool-service-dev"
        platform_version                   = "1.4.0"
      - propagate_tags                     = "NONE" -> null
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Name"            = "qppsf-ct-ecr-dev"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-dev:18" -> (known after apply)

      - deployment_controller {
          - type = "ECS" -> null
        }

        load_balancer {
            container_name   = "conversion-tool"
            container_port   = 8080
            target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-dev/68be251dab93e230"
        }
      + load_balancer { # forces replacement
          + container_name   = "conversion-tool"
          + container_port   = 8443
          + target_group_arn = (known after apply)
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-01f29f7f32a8789ef",
                "sg-030ae9a65cdad1954",
                "sg-0377d36214f7db48c",
                "sg-15ab1d66",
            ]
            subnets          = [
                "subnet-2d23a177",
                "subnet-913b76d9",
                "subnet-d59f7ab1",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.conversion-tool.aws_ecs_task_definition.conversion-tool must be replaced
-/+ resource "aws_ecs_task_definition" "conversion-tool" {
      ~ arn                      = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-dev:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    command          = [
                        "/usr/src/run/qppConverter.sh",
                    ]
                  - cpu              = 0 -> null
                    environment      = []
                    essential        = true
                    image            = "003384571330.dkr.ecr.us-east-1.amazonaws.com/qppsf/conversion-tool/dev:latest"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/qppsf/conversion-tool-dev"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "dev"
                        }
                    }
                    mountPoints      = []
                    name             = "conversion-tool"
                  ~ portMappings     = [
                      + {
                          + containerPort = 8443
                          + hostPort      = 8443
                          + protocol      = "tcp"
                        },
                        {
                            containerPort = 8080
                            hostPort      = 8080
                            protocol      = "tcp"
                        },
                    ]
                    secrets          = [
                        {
                            name      = "APP_ENV"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/APP_ENV"
                        },
                        {
                            name      = "AR_API_BASE_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/AR_API_BASE_URL"
                        },
                        {
                            name      = "BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/BUCKET_NAME"
                        },
                        {
                            name      = "CPC_END_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/CPC_END_DATE"
                        },
                        {
                            name      = "CPC_PLUS_BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/CPC_PLUS_BUCKET_NAME"
                        },
                        {
                            name      = "CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                        },
                        {
                            name      = "CPC_PLUS_VALIDATION_FILE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/CPC_PLUS_VALIDATION_FILE"
                        },
                        {
                            name      = "DB_APP_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DB_APP_PASSWORD"
                        },
                        {
                            name      = "DB_APP_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DB_APP_USERNAME"
                        },
                        {
                            name      = "DB_MASTER_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DB_MASTER_PASSWORD"
                        },
                        {
                            name      = "DB_MASTER_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DB_MASTER_USERNAME"
                        },
                        {
                            name      = "DEPLOY0A_PUBLIC-I-P"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DEPLOY0A_PUBLIC-I-P"
                        },
                        {
                            name      = "DYNAMO_TABLE_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/DYNAMO_TABLE_NAME"
                        },
                        {
                            name      = "FMS_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/FMS_TOKEN"
                        },
                        {
                            name      = "GDIT_NESSUS_PUB_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/GDIT_NESSUS_PUB_KEY"
                        },
                        {
                            name      = "JAVA_OPTS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/JAVA_OPTS"
                        },
                        {
                            name      = "KMS_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/KMS_KEY"
                        },
                        {
                            name      = "NEWRELIC_API_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/NEWRELIC_API_KEY"
                        },
                        {
                            name      = "NEXUS_CREDS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/NEXUS_CREDS"
                        },
                        {
                            name      = "NEXUS_HOST"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/NEXUS_HOST"
                        },
                        {
                            name      = "ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/ORG_NAME"
                        },
                        {
                            name      = "SPLUNK_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/SPLUNK_TOKEN"
                        },
                        {
                            name      = "VALIDATION_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/VALIDATION_URL"
                        },
                        {
                            name      = "RTI_ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/dev/conversion_tool/RTI_ORG_NAME"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "2048"
        execution_role_arn       = "arn:aws:iam::003384571330:role/qppsf-ct-execution-role-dev"
        family                   = "qppsf-conversion-tool-td-dev"
      ~ id                       = "qppsf-conversion-tool-td-dev" -> (known after apply)
        memory                   = "5120"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::003384571330:role/ecsTaskExecutionRole"
    }

  # module.conversion-tool.aws_lb_listener.conversion-tool will be created
  + resource "aws_lb_listener" "conversion-tool" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:loadbalancer/app/qppsf-conversion-tool-lb-dev/c0d361c2b742565c"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-dev/68be251dab93e230"
          + type             = "forward"
        }
    }

  # module.conversion-tool.aws_lb_listener.conversion-tool-ssl will be created
  + resource "aws_lb_listener" "conversion-tool-ssl" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:003384571330:certificate/4e09608a-6e5f-4a30-a2aa-e0b4e257eeef"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:loadbalancer/app/qppsf-conversion-tool-lb-dev/c0d361c2b742565c"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.conversion-tool.aws_lb_target_group.conversion-tg-ssl will be created
  + resource "aws_lb_target_group" "conversion-tg-ssl" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "conversion-tg-dev-ssl"
      + port                               = 8443
      + protocol                           = "HTTPS"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"            = "qppsf-ct-ecr-dev"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ef66577"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-499"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.conversion-tool.aws_s3_bucket.certs_bucket will be created
  + resource "aws_s3_bucket" "certs_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "qppsf-conversion-tool-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"            = "qppsf-ct-s3-certs-bucket"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "default-lifecycle"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.conversion-tool.aws_s3_bucket_policy.certs_bucket will be created
  + resource "aws_s3_bucket_policy" "certs_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.conversion-tool.aws_s3_bucket_public_access_block.certs_bucket-public-access-block will be created
  + resource "aws_s3_bucket_public_access_block" "certs_bucket-public-access-block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.conversion-tool.aws_security_group.ct_app will be updated in-place
  ~ resource "aws_security_group" "ct_app" {
        arn                    = "arn:aws:ec2:us-east-1:003384571330:security-group/sg-030ae9a65cdad1954"
        description            = "Allow inbound traffic"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        id                     = "sg-030ae9a65cdad1954"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0377d36214f7db48c",
                ]
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0377d36214f7db48c",
                ]
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0377d36214f7db48c",
                ]
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "conversion-tool-app-dev"
        owner_id               = "003384571330"
        revoke_rules_on_delete = false
        tags                   = {
            "Name" = "conversion-tool-app-dev"
        }
        vpc_id                 = "vpc-0ef66577"
    }

  # module.conversion-tool.aws_security_group_rule.allow_https will be created
  + resource "aws_security_group_rule" "allow_https" {
      + cidr_blocks              = [
          + "10.247.224.0/21",
          + "10.232.36.0/24",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0377d36214f7db48c"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-http-elb-to-ui will be created
  + resource "aws_security_group_rule" "ct-ingress-from-http-elb-to-ui" {
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-030ae9a65cdad1954"
      + self                     = false
      + source_security_group_id = "sg-0377d36214f7db48c"
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-https-elb-to-ui will be created
  + resource "aws_security_group_rule" "ct-ingress-from-https-elb-to-ui" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-030ae9a65cdad1954"
      + self                     = false
      + source_security_group_id = "sg-0377d36214f7db48c"
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_ssm_parameter.ssl_secret will be created
  + resource "aws_ssm_parameter" "ssl_secret" {
      + arn         = (known after apply)
      + description = "SSL KeyStore Password"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/qppar-sf/dev/conversion_tool/SSL_SECRET"
      + overwrite   = true
      + tags        = {
          + "Name"            = "qppsf-ct-ssm-dev"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

Plan: 14 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.